# General information

<i>'No BS, just essential Pandas!'</i> 

Cheat sheet to data wrangling with Python Pandas. The aim is to cover essential tips and tricks to imporove data work flows. Each topic is featured with a minimal working example. The cheat sheet is work in progress, all improvement sugeestions are welcome!

Note1: Run the first code cell to load dependencies and auxuliary functions.

Note2: Section numbering or links in the table of contents do unfortunately not work in the code cells itself due to restrictions in Github Jupyter notebook support. Use browser search field instead to locate desired headline.

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc" style="margin-top: 1em;"><ul class="toc-item"><li><span><a href="#General-information" data-toc-modified-id="General-information-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>General information</a></span></li><li><span><a href="#Reading-in-data" data-toc-modified-id="Reading-in-data-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Reading in data</a></span><ul class="toc-item"><li><span><a href="#Excel-files" data-toc-modified-id="Excel-files-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Excel files</a></span><ul class="toc-item"><li><span><a href="#Import-Excel-file" data-toc-modified-id="Import-Excel-file-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>Import Excel file</a></span></li><li><span><a href="#Export-Excel-file" data-toc-modified-id="Export-Excel-file-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Export Excel file</a></span></li></ul></li><li><span><a href="#SQL" data-toc-modified-id="SQL-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>SQL</a></span><ul class="toc-item"><li><span><a href="#Import-SQL-table" data-toc-modified-id="Import-SQL-table-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>Import SQL table</a></span></li></ul></li></ul></li><li><span><a href="#Basic-DataFrame-operations" data-toc-modified-id="Basic-DataFrame-operations-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Basic DataFrame operations</a></span><ul class="toc-item"><li><span><a href="#DataFrame-initialization" data-toc-modified-id="DataFrame-initialization-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>DataFrame initialization</a></span></li><li><span><a href="#Modifying-DataFrame" data-toc-modified-id="Modifying-DataFrame-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Modifying DataFrame</a></span><ul class="toc-item"><li><span><a href="#Renaming-columns" data-toc-modified-id="Renaming-columns-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>Renaming columns</a></span></li><li><span><a href="#Reverse-order-of-columns" data-toc-modified-id="Reverse-order-of-columns-3.2.2"><span class="toc-item-num">3.2.2&nbsp;&nbsp;</span>Reverse order of columns</a></span></li><li><span><a href="#Changing-data-types" data-toc-modified-id="Changing-data-types-3.2.3"><span class="toc-item-num">3.2.3&nbsp;&nbsp;</span>Changing data types</a></span></li><li><span><a href="#Add-row-to-DataFrame" data-toc-modified-id="Add-row-to-DataFrame-3.2.4"><span class="toc-item-num">3.2.4&nbsp;&nbsp;</span>Add row to DataFrame</a></span></li><li><span><a href="#Dropping-from-DataFrame" data-toc-modified-id="Dropping-from-DataFrame-3.2.5"><span class="toc-item-num">3.2.5&nbsp;&nbsp;</span>Dropping from DataFrame</a></span></li><li><span><a href="#Altering-DataFrame-values-by-broadcasting" data-toc-modified-id="Altering-DataFrame-values-by-broadcasting-3.2.6"><span class="toc-item-num">3.2.6&nbsp;&nbsp;</span>Altering DataFrame values by broadcasting</a></span></li></ul></li><li><span><a href="#Slicing-data-frame" data-toc-modified-id="Slicing-data-frame-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Slicing data frame</a></span><ul class="toc-item"><li><span><a href="#Basic-sclicing" data-toc-modified-id="Basic-sclicing-3.3.1"><span class="toc-item-num">3.3.1&nbsp;&nbsp;</span>Basic sclicing</a></span></li><li><span><a href="#Conditional-slicing/indexing-(boolean-masking)" data-toc-modified-id="Conditional-slicing/indexing-(boolean-masking)-3.3.2"><span class="toc-item-num">3.3.2&nbsp;&nbsp;</span>Conditional slicing/indexing (boolean masking)</a></span></li></ul></li><li><span><a href="#Iterating-over-DataFrame" data-toc-modified-id="Iterating-over-DataFrame-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Iterating over DataFrame</a></span></li><li><span><a href="#About-chain-indexing" data-toc-modified-id="About-chain-indexing-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>About chain indexing</a></span></li><li><span><a href="#Method-chaining" data-toc-modified-id="Method-chaining-3.6"><span class="toc-item-num">3.6&nbsp;&nbsp;</span>Method chaining</a></span></li><li><span><a href="#Data-types-and-scales" data-toc-modified-id="Data-types-and-scales-3.7"><span class="toc-item-num">3.7&nbsp;&nbsp;</span>Data types and scales</a></span></li></ul></li><li><span><a href="#Hierarchical-indexing-(MultiIndex)" data-toc-modified-id="Hierarchical-indexing-(MultiIndex)-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Hierarchical indexing (MultiIndex)</a></span><ul class="toc-item"><li><span><a href="#Initialize-DataFrame-with-hierarchical-indexing" data-toc-modified-id="Initialize-DataFrame-with-hierarchical-indexing-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Initialize DataFrame with hierarchical indexing</a></span></li><li><span><a href="#Modifying-MultiIndex-DataFrame" data-toc-modified-id="Modifying-MultiIndex-DataFrame-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Modifying MultiIndex DataFrame</a></span><ul class="toc-item"><li><span><a href="#Add-second-index-to-existing-DataFrame" data-toc-modified-id="Add-second-index-to-existing-DataFrame-4.2.1"><span class="toc-item-num">4.2.1&nbsp;&nbsp;</span>Add second index to existing DataFrame</a></span></li><li><span><a href="#Add-new-column-to-existing-MultiIndex-DataFrame" data-toc-modified-id="Add-new-column-to-existing-MultiIndex-DataFrame-4.2.2"><span class="toc-item-num">4.2.2&nbsp;&nbsp;</span>Add new column to existing MultiIndex DataFrame</a></span></li><li><span><a href="#Get-different-MultiIndex-levels" data-toc-modified-id="Get-different-MultiIndex-levels-4.2.3"><span class="toc-item-num">4.2.3&nbsp;&nbsp;</span>Get different MultiIndex levels</a></span></li></ul></li><li><span><a href="#Quering-MultiIndex-DataFrames" data-toc-modified-id="Quering-MultiIndex-DataFrames-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Quering MultiIndex DataFrames</a></span></li></ul></li><li><span><a href="#Data-wrangling-tricks" data-toc-modified-id="Data-wrangling-tricks-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Data wrangling tricks</a></span><ul class="toc-item"><li><span><a href="#Mappings-for-column-values" data-toc-modified-id="Mappings-for-column-values-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Mappings for column values</a></span><ul class="toc-item"><li><span><a href="#One-to-one-mappings" data-toc-modified-id="One-to-one-mappings-5.1.1"><span class="toc-item-num">5.1.1&nbsp;&nbsp;</span>One-to-one mappings</a></span></li><li><span><a href="#Map-values-to-ranges/groups" data-toc-modified-id="Map-values-to-ranges/groups-5.1.2"><span class="toc-item-num">5.1.2&nbsp;&nbsp;</span>Map values to ranges/groups</a></span></li><li><span><a href="#Categorical-variable-to-dummy-columns" data-toc-modified-id="Categorical-variable-to-dummy-columns-5.1.3"><span class="toc-item-num">5.1.3&nbsp;&nbsp;</span>Categorical variable to dummy columns</a></span></li></ul></li><li><span><a href="#Change-between-long/wide-format" data-toc-modified-id="Change-between-long/wide-format-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Change between long/wide format</a></span><ul class="toc-item"><li><span><a href="#Wide-to-long" data-toc-modified-id="Wide-to-long-5.2.1"><span class="toc-item-num">5.2.1&nbsp;&nbsp;</span>Wide to long</a></span></li><li><span><a href="#Long-to-wide" data-toc-modified-id="Long-to-wide-5.2.2"><span class="toc-item-num">5.2.2&nbsp;&nbsp;</span>Long to wide</a></span></li></ul></li><li><span><a href="#Database-like-joins" data-toc-modified-id="Database-like-joins-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>Database-like joins</a></span></li><li><span><a href="#Aggregating-infromation-in-DataFrame" data-toc-modified-id="Aggregating-infromation-in-DataFrame-5.4"><span class="toc-item-num">5.4&nbsp;&nbsp;</span>Aggregating infromation in DataFrame</a></span><ul class="toc-item"><li><span><a href="#Simple-means,-medians-etc." data-toc-modified-id="Simple-means,-medians-etc.-5.4.1"><span class="toc-item-num">5.4.1&nbsp;&nbsp;</span>Simple means, medians etc.</a></span></li><li><span><a href="#'Group-by'-in-various-forms" data-toc-modified-id="'Group-by'-in-various-forms-5.4.2"><span class="toc-item-num">5.4.2&nbsp;&nbsp;</span>'Group by' in various forms</a></span></li><li><span><a href="#Agg-method" data-toc-modified-id="Agg-method-5.4.3"><span class="toc-item-num">5.4.3&nbsp;&nbsp;</span>Agg method</a></span></li><li><span><a href="#Pivot-table" data-toc-modified-id="Pivot-table-5.4.4"><span class="toc-item-num">5.4.4&nbsp;&nbsp;</span>Pivot table</a></span></li></ul></li></ul></li><li><span><a href="#Data-cleaning" data-toc-modified-id="Data-cleaning-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Data cleaning</a></span><ul class="toc-item"><li><span><a href="#Replace-all-non-numerical-values-with-NaN" data-toc-modified-id="Replace-all-non-numerical-values-with-NaN-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>Replace all non-numerical values with NaN</a></span></li><li><span><a href="#Clean-NaN-values" data-toc-modified-id="Clean-NaN-values-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>Clean NaN values</a></span></li></ul></li><li><span><a href="#Working-with-time-and-dates" data-toc-modified-id="Working-with-time-and-dates-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Working with time and dates</a></span><ul class="toc-item"><li><span><a href="#Time-and-date-data-types" data-toc-modified-id="Time-and-date-data-types-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Time and date data types</a></span></li><li><span><a href="#Time-series-tricks" data-toc-modified-id="Time-series-tricks-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Time series tricks</a></span><ul class="toc-item"><li><span><a href="#Basic-operations" data-toc-modified-id="Basic-operations-7.2.1"><span class="toc-item-num">7.2.1&nbsp;&nbsp;</span>Basic operations</a></span></li><li><span><a href="#Get-mean-value-per-day-over-multiple-years" data-toc-modified-id="Get-mean-value-per-day-over-multiple-years-7.2.2"><span class="toc-item-num">7.2.2&nbsp;&nbsp;</span>Get mean value per day over multiple years</a></span></li></ul></li></ul></li></ul></div>

In [1]:
############################################################
# Run this cell!
# Dependencies, auxiliary functions etc.
############################################################
import pandas as pd
import numpy as np
import datetime
from IPython.display import display_html
from IPython.display import display

def display_side_by_side(*args):
    html_str=''
    for df in args:
        html_str+=df.to_html()
    html_str = html_str.replace('table','table style="display:inline; border:0px"')          
    display_html(html_str,raw=True)

# Reading in data

## Excel files

### Import Excel file

In [ ]:
# Example applies to Windows paths
import os
path = r'C:\myfolder'
file = 'myfile.xlsx'
df = pd.read_excel(os.path.join(path,file))
df = pd.read_excel(os.path.join(path,file)
                   ,sheetname = 'Sheet1'
                   ,skiprows = 16
                   ,parse_cols = ("A,C:F")
                   ,header = None
                   ,index_col = 0
                  )

<h3>Export Excel file</h3>

In [ ]:
# Example applies to Windows paths
import os
path = r'C:\myfolder'
file = 'myfile.xlsx'
writer = pd.ExcelWriter(os.path.join(path,file))
df.to_excel(writer,'Sheet1', header = True)
writer.save()

## SQL

### Import SQL table

In [80]:
# FILL!

# Basic DataFrame operations

## DataFrame initialization

In [3]:
# Initialize DataFrame with dummy data and custom indices
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uu'])
display(df)

         ff        ee        tt        uu
0  0.287221  0.095670  0.694925  0.271790
1  0.860000  0.791921  0.396560  0.733316
2  0.592265  0.637052  0.613975  0.527045
3  0.428781  0.581568  0.914475  0.082315

In [4]:
# Initialize DataFrame with custom data
data = {'ID': [1, 2, 3],'Names': ['Kate', 'John', 'Max'],'Age': [50, 25, 41], 'Values': [3, 4, 8]}
df = pd.DataFrame(data=data, columns = ['ID', 'Names', 'Age', 'Values', 'Country'])

# Set one of the columns as index
df2 = df.set_index('ID')
df2.index.name = None # remove index name

# Re-setting index
df3 = df2.copy()
df3.reset_index(inplace = True, drop = True) # drop = True drops denies addition of old index to columns

display_side_by_side(df,df2,df3)

## Modifying DataFrame

### Renaming columns

In [5]:
data = {'ID': [1, 2, 3],'Names': ['Kate', 'John', 'Max'],'Age': [50, 25, 41], 'Values': [3, 4, 8]}
df = pd.DataFrame(data=data)
df2 = df.copy()
df.rename(columns={"Names": "Name", "Age": "Alter"}, inplace=True)
display_side_by_side(df2,df)

,Age,ID,Names,Values
0,50,1,Kate,3
1,25,2,John,4
2,41,3,Max,8
,Alter,ID,Name,Values
0,50,1,Kate,3
1,25,2,John,4
2,41,3,Max,8

### Reverse order of columns

In [9]:
data = {'ID': [1, 2,],'Names': ['John', 'Max'],'Vals1': [50, 41], 'Vals2': [4.0, 8.0], 'Vals3': ['4.4', '3.1']}
df = pd.DataFrame(data=data)
df2 = df.iloc[:, ::-1].copy()
display_side_by_side(df,df2)

,ID,Names,Vals1,Vals2,Vals3
0,1,John,50,4.0,4.4
1,2,Max,41,8.0,3.1
,Vals3,Vals2,Vals1,Names,ID
0,4.4,4.0,50,John,1
1,3.1,8.0,41,Max,2

### Changing data types

In [10]:
data = {'ID': [1, 2, 3],'Names': ['Kate', 'John', 'Max']
        ,'Vals1': [50, 25, 41], 'Vals2': [3.0, 4.0, 8.0], 'Vals3': ['3.0', '4.4', '3.1']}
df = pd.DataFrame(data=data)
df2 = df.copy()

# Here we convert to numpy data types instead of native python types (float/int)
# Numpy data types are of fixed size but are more efficient
df2['Vals1'] = df2['Vals1'].astype('float64')
df2['Vals2'] = df2['Vals2'].astype('int64')
df2['Vals3'] = df2['Vals3'].astype('float64') # string to float, see also pd.to_numeric

display_side_by_side(df,df2)

,ID,Names,Vals1,Vals2,Vals3
0,1,Kate,50,3.0,3.0
1,2,John,25,4.0,4.4
2,3,Max,41,8.0,3.1
,ID,Names,Vals1,Vals2,Vals3
0,1,Kate,50.0,3,3.0
1,2,John,25.0,4,4.4
2,3,Max,41.0,8,3.1

### Add row to DataFrame

In [8]:
data = {'ID': [1, 2,],'Names': ['John', 'Max'],'Vals1': [50, 41], 'Vals2': [4.0, 8.0], 'Vals3': ['4.4', '3.1']}
df = pd.DataFrame(data=data)

df2 = pd.DataFrame({'ID': [4], 'Names': ['Janet'],'Vals1': [50], 'Vals2': [12.0], 'Vals3': ['2.9']})
df3 = df.append(df2, ignore_index=True)

display_side_by_side(df,df3)

,ID,Names,Vals1,Vals2,Vals3
0,1,John,50,4.0,4.4
1,2,Max,41,8.0,3.1
,ID,Names,Vals1,Vals2,Vals3
0,1,John,50,4.0,4.4
1,2,Max,41,8.0,3.1
2,4,Janet,50,12.0,2.9

### Dropping from DataFrame

In [178]:
data = {'ID': [1, 2, 3, 4, 5, 6]
        ,'Names': ['Kate', 'John', 'Max', 'Mary', 'Pete', 'Miriam']
        ,'Age': [50, 25, 41, 99, 54, 23]
        , 'Values': [3, 4, 8, 4, 3, 4]
        , 'col': [None]}
df_orig = pd.DataFrame(data=data, index = ['a','b','c','d', 'e', 'f'])
df = df_orig.copy()

# Drop columns by column label
df.drop(['Age', 'Names'], axis = 1, inplace = True)

# Drop column by fancy indexing
df.drop(df.columns[0], axis = 1, inplace = True)

# Drop column by ugin del; is directly inplace!
del df['col']

# Drop rows by index label
df.drop(['b'], axis = 0 , inplace = True)

# Drop rows by index number
df.drop(df.index[[0]], axis = 0 , inplace = True)

# Drop rows where value in column does not fulfill condition
df = df[df['Values'] <= 5]

# Drop first n = 1 rows
df.drop(df.head(1).index,inplace=True)

# Drop last n = 1 rows
df.drop(df.tail(1).index,inplace=True) # drop last n rows

display_side_by_side(df_orig,df)

In [10]:
# Drop other columns except those we want to keep
data = {'ID': [1, 2, 3, 4],'Names': ['Kate', 'John', 'Max', 'Mary'],'Age': [50, 25, 41,99], 'Values': [3, 4, 8,4], 'col': [None]}
df_orig = pd.DataFrame(data=data, index = ['a','b','c','d'])
columns_to_keep = ['Names','Values']
df = df[columns_to_keep]
display(df)

  Names  Values
a  Kate       3
b  John       4
c   Max       8
d  Mary       4

### Altering DataFrame values by broadcasting

In [40]:
df = pd.DataFrame(np.arange(12).reshape(6,2),columns = ['ff', 'er'])
df2 = df.copy()
df2['ff'] *= 0.8
df2['er'] -= 2
display_side_by_side(df,df2)

,ff,er
0,0,1
1,2,3
2,4,5
3,6,7
4,8,9
5,10,11
,ff,er
0,0.0,-1
1,1.6,1
2,3.2,3
3,4.8,5
4,6.4,7
5,8.0,9

## Slicing data frame

### Basic sclicing

In [8]:
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])

# Selecting columns
# Using single square brackets selects a Series from DataFrame. 
# Using multiple square brackets selects a slice of data frame (possibly with muliple columns) 
df['ff'] # returns Series
df[['ff']] # returns DataFrame with one column
df[['ff','ee']] # returns DataFrame with two columns
df.loc[:,['ee','tt']]
df.iloc[:,0] # by position in frame

# Selecting rows
df.loc['first'] # by index
df.loc[~('first')] # negation in pandas is ~
df.loc[['first','fourth']] # by index multiple rows
df[0:3]
df.iloc[0:2] # by position in frame

# Using data[2] or data['label'] indexes the series itself, skipping the iloc/loc
# attributes. This is syntatic sugar, but it is safer to use iloc/loc attributes
# explicitly in order avoid confusion querying between index label and index position.

# Example printed out
display_side_by_side(df, df.loc[:,['ee','tt']], df.iloc[0:2])

### Conditional slicing/indexing (boolean masking)

In [28]:
data = {'ID': [1, 2, 3, 4],'Names': ['Kate', 'John', 'Max', 'Mary'],'Age': [50, 25, 41,99], 'Values': [3, 4, 8,4]}
df = pd.DataFrame(data=data, index = ['a','b','c','d'])

# Get row slice fulfilling a conditions along one column, return with
# certain columns (leave column name empty for all columns)
df2 = pd.DataFrame(df.loc[df['Values'] < 5,  ['Names', 'Values']].copy())

# Same as above but multiple conditions, all columns
df3 = df.loc[(df['Values'] < 5 ) & (df['Names'] == 'John'), ].copy()

# Conditional indexing by preserving original dimensions
df4 = df.where(df['Values'] < 5).copy()

display_side_by_side(df,df2,df3,df4)

## Iterating over DataFrame

In [15]:
data = {'Names': ['Kate', 'John', 'Max'],'Age': [50, 25, 41], 'Weight': [62, 76, 98]}
df = pd.DataFrame(data=data)

# "Right" way with df.iterrows 
for index, row in df.iterrows():
    print(index, row['Age'])

print('-'*30)    

# "Normal" integer looping over rows
for counter in range(0,len(df)):
    print(df.iloc[counter,0])

0 50
1 25
2 41
------------------------------
50
25
41

In [16]:
# Set values during row iteration
data = {'Names': ['Kate', 'John', 'Max'],'Age': [50, 25, 41], 'Weight': [62, 76, 98]}
df = pd.DataFrame(data=data)
df2 = df.copy()

for index, row in df2.iterrows():
    if row['Names'] == 'John':
        df2.set_value(index,'Weight',100)
display_side_by_side(df,df2)

,Age,Names,Weight
0,50,Kate,62
1,25,John,76
2,41,Max,98
,Age,Names,Weight
0,50,Kate,62
1,25,John,100
2,41,Max,98

## About chain indexing

In [11]:
# A rule of thub is that any time you see back-to-back square brackets,
# ][, you're asking for trouble. Replace that with a .loc[] or .iloc[]
# and you'll be set. Let's see an example
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
display(df)
print(df['ee']['second']) # bad practice
print(df.loc['second','ee']) # good practice

              ff        ee        tt       uuu
first   0.544906  0.709303  0.225075  0.345436
second  0.145874  0.425869  0.801638  0.967697
third   0.778733  0.961241  0.931972  0.589609
fourth  0.558068  0.375977  0.660797  0.990468

0.425868848294
0.425868848294

In [39]:
# Another example
df = pd.DataFrame()
df['x'] = np.arange(10,14)
df['value'] = np.arange(200,204)
display(df)

print(df[ df['x']== 10 ]['value']) # bad practice
print('-'*30)
print(df.loc[df['x'] == 10, 'value']) # good practice

# The worser option would't even work in the case
# we want to assign a new value for the returned obseravtions

#df[ df['x']== 10 ]['value'] = 1000 # this doesn't work!
print('-'*30)
df.loc[df['x'] == 10, 'value'] = 1000
display(df)

    x  value
0  10    200
1  11    201
2  12    202
3  13    203

0    200
Name: value, dtype: int32
------------------------------
0    200
Name: value, dtype: int32
------------------------------

    x  value
0  10   1000
1  11    201
2  12    202
3  13    203

## Method chaining

In [12]:
# The pandorable way is to chain methods operating on DataFrame:
data = {'Names': ['Kate', 'John', 'Max'],'Age': [50, 25, 41], 'Weight': [62, 76, 98]}
df = pd.DataFrame(data=data)

df2 = df.copy()
# Not-so-good practice: two lines of code
df2 = df2.drop(df2[df2['Age'] == 25].index)
df2.rename(columns={'Weight': 'Weight (kg)'}, inplace = True)

df3 = df.copy()
# Better practice - on line of code
df3 = df3.drop(df3[df3['Age'] == 25].index).rename(columns={'Weight': 'Weight (kg)'}).copy()

display_side_by_side(df,df2,df3)

,Age,Names,Weight
0,50,Kate,62
1,25,John,76
2,41,Max,98
,Age,Names,Weight (kg)
0,50,Kate,62
2,41,Max,98
,Age,Names,Weight (kg)
0,50,Kate,62
2,41,Max,98

## Data types and scales

This section is till incomplete!

In general, there are 4 types of data scales
<ol>
  <li>Ratio scale, e.g. height</li>
  <li>Inteval scale, e.g. temperature</li>
  <li>Ordinal scale, e.g. grading scale</li>
  <li>Nominal scale, e.g. school names</li>
</ol>

In [81]:
# Specify a column in DataFrame to be gatecorigal, sort by categorical order
df = pd.DataFrame(['E','M','L','M','I','A','B','B','M'], columns = ['Grades'])

# Categories need to be passed in ascending order!
df['Grades'] = df['Grades'].astype('category', categories = ['I','A','B','C','M','E','L'], ordered = True)
df2 = df.sort_values(['Grades'], ascending  = False).copy()
df3 = df[df['Grades'] >= 'M'].copy()

display_side_by_side(df,df2,df3)

,Grades
0,E
1,M
2,L
3,M
4,I
5,A
6,B
7,B
8,M
,Grades
2,L
0,E
8,M
3,M
1,M
7,B
6,B
5,A
4,I
,Grades
0,E
1,M
2,L
3,M
8,M

# Hierarchical indexing (MultiIndex)

## Initialize DataFrame with hierarchical indexing

In [24]:
df = pd.DataFrame(data = np.arange(12).reshape((4,3))
                  ,index = [['a','a','b','b',], [1,2] * 2]
                  ,columns = [['col1','col1','col2'], ['ff','gg','ff']])
display_side_by_side(df)

## Modifying MultiIndex DataFrame

### Add second index to existing DataFrame

In [8]:
df = pd.DataFrame(data = np.arange(12).reshape((4,3))
                  ,columns = ['col1','col1','col2'])
df2 = df.copy()
df2.set_index([df2.index, 'col2'],inplace=True)
df2.index.names = ['Index1', 'Index2']
display_side_by_side(df,df2)

,col1,col1,col2
0,0,1,2
1,3,4,5
2,6,7,8
3,9,10,11
,,col1,col1
Index1,Index2,,
0,2,0,1
1,5,3,4
2,8,6,7
3,11,9,10

### Add new column to existing MultiIndex DataFrame

In [27]:
df = pd.DataFrame(data = np.arange(16).reshape((4,4))
                  ,index = [['a','a','b','b',], [1,2] * 2]
                  ,columns = [['col1','col1','col2','col2'], ['ff','gg','ff','gg']])
# Add new column to MultiIndex frame
df2 = df.copy()
df2['col2', 'dd'] = [0, 1, 2, 4]
display_side_by_side(df,df2)

### Get different MultiIndex levels

In [23]:
df = pd.DataFrame(data = np.arange(12).reshape((4,3))
                  ,index = [['a','a','b','b',], [1,2] * 2]
                  ,columns = [['col1','col1','col2'], ['ff','gg','ff']])

print(df.columns.get_level_values(0))
print(df.columns.get_level_values(1))
print(df.index.get_level_values(0))
print(df.index.get_level_values(1))

Index(['col1', 'col1', 'col2'], dtype='object')
Index(['ff', 'gg', 'ff'], dtype='object')
Index(['a', 'a', 'b', 'b'], dtype='object')
Int64Index([1, 2, 1, 2], dtype='int64')

## Quering MultiIndex DataFrames

In [26]:
df = pd.DataFrame(data = np.arange(16).reshape((4,4))
                  ,index = [['a','a','b','b',], [1,2] * 2]
                  ,columns = [['col1','col1','col2','col2'], ['ff','gg','ff','gg']])

# Get observations from certain column level
df2 = df.iloc[:, df.columns.get_level_values(1) == 'gg'].copy()

# Get observations from certain index level
df3 = df.iloc[df.index.get_level_values(1) == 2,:].copy()

# Get observations from certain column levels (multi-condition)
df4 = df.iloc[:, (df.columns.get_level_values(0) == 'col1') & (df.columns.get_level_values(1) == 'gg')].copy()

display_side_by_side(df,df2,df3,df4)

# Data wrangling tricks

## Mappings for column values

### One-to-one mappings

In [29]:
data = {'ID': [1, 2, 3,4],'Names': ['Kate', 'John', 'Max','Kate'],'Age': [50, 25, 41,89], 'Values': [3, 4, 8, 12]}
df = pd.DataFrame(data=data)
df2 = df.copy()

# Mapping from user defined dict
age_mapping = {25:0, 41:1, 50:2, 89:3}
df2['AgeOrder'] = df2['Age'].map(age_mapping)
display_side_by_side(df,df2)

In [31]:
data = {'ID': [1, 2, 3,4],'Names': ['Kate', 'John', 'Max','Kate'],'Age': [50, 25, 41,89], 'Values': [3, 4, 8, 12]}
df = pd.DataFrame(data=data)
df2 = df.copy()

# Assign unique identifier to values in column (Names -> NameID)
d = {key: value for (key, value) in zip(df['Names'].unique(),range(len(df['Names'].unique())))}
df2['NameID'] = df2['Names'].map(d)
display_side_by_side(df,df2)

### Map values to ranges/groups

In [87]:
data = {'ID': [1, 2, 3,4],'Names': ['Kate', 'John', 'Max','Kate'],'Age': [39, 18, 25,75], 'Values': [3, 4, 8, 12]}
df = pd.DataFrame(data=data)
df2 = df.copy()

# Even-sized bins 
df2['ValGroup1'] = pd.cut(df2['Values'] ,4 ,right = True) # 4 bins, includes rightmost edge
                    
# Relative-sized bins 
df2['ValGroup2'] = pd.qcut(df2['Values'], 4)

# Custom bin sizes and labels
df2['AgeGroup'] = pd.cut(df2['Age'], [0, 20, 40, 60, 80, np.inf], labels = [1,2,3,4,5], right = True)

display_side_by_side(df,df2)

### Categorical variable to dummy columns

In [86]:
df = pd.DataFrame({'Category': ['Type1','Type2','Type1','Type3'], 'Value': np.random.rand(4)})

df2 = df.copy()
df2['Category'] = df2['Category'].astype('category', categories = ['Type1','Type2','Type3'], ordered = True)
df2 = pd.get_dummies(df2, prefix=['Category'])

display_side_by_side(df,df2)

## Change between long/wide format

### Wide to long

In [15]:
# Create data
df = pd.DataFrame(data = np.arange(9).reshape((3,3)), columns = [['col1','col2','col3']])

df2 = pd.DataFrame(data = np.arange(12).reshape((4,3))
                  ,index = [['a','a','b','b',], [1,2] * 2]
                  ,columns = [['col1','col1','col2'], ['ff','gg','ff']])

# Simple melt
df3 = pd.melt(df).copy()
df4 = pd.melt(df2).copy()

display_side_by_side(df,df3,df2,df4)

### Long to wide

In [11]:
# Create data
df = pd.DataFrame({
         'name1': ['A','A','B','B']
        ,'name2': ['A','B','A','B']
        ,'val': [5,9,7,3]})

df2 = df.pivot(index = 'name1',columns = 'name2',values = 'val').copy()

# If the above does not work, try pivot table which is a generalization of
# pivot for duplicate entries.
df3 = df.pivot_table(values = 'val', index = 'name1', columns = 'name2').copy()

display_side_by_side(df,df2,df3)

In [88]:
# Pivot_table might not work with non-numeric columns
# In this case try the following (does however not work
# with duplicate indices

df = pd.DataFrame({'index' : range(8),
'variable1' : ["A","A","B","B","A","B","B","A"],
'variable2' : ["a","b","a","b","a","b","a","b"],
'result': ["on","off","off","on","on","off","off","on"]})

df1 = df.copy()
unstack_cols = ['variable1', 'variable2']
df1 = df.set_index(['index'] + unstack_cols).unstack(level=unstack_cols)
display_side_by_side(df,df1)

In [5]:
# Long to wide with time series type of data
data = { 'ID': [1, 1, 2, 2, 1, 1, 2, 2]
        ,'Date': ['2007-01-01','2007-01-01', '2007-01-01','2007-01-01', '2007-01-02','2007-01-02', '2007-01-02','2007-01-02']
        ,'Type': ['type1','type2','type1','type2','type1','type2','type1','type2']
        ,'Values': np.arange(8)}
df = pd.DataFrame(data=data)

df2 = df.groupby(['Date','ID','Type']).sum().unstack('ID').copy()
# Flatten columns
new_col_names = ['_'.join((str(b),a)) for a,b in df2.columns.get_values()]
df2.columns = new_col_names

df3 = df.groupby(['Date','ID','Type']).sum().unstack(['ID','Type']).copy()
new_col_names = ['_'.join((a,str(b),c)) for a,b,c in df3.columns.get_values()]
df3.columns = new_col_names

display_side_by_side(df,df2,df3)

## Database-like joins

In [2]:
# Create data
df = pd.DataFrame(data = np.arange(12).reshape((3,4)), columns = [['col1','col2','col3','col4']])
df2 = pd.DataFrame({'key': [0,1,2], 'vals': [4,6,8]})
display_side_by_side(df,df2)

In [9]:
# Different merges
df3 = pd.merge(df,df2,left_index = True, right_on = 'key',how = 'left')
df4 = pd.merge(df,df2,left_on = 'col2', right_on = 'key',how = 'left')
df5 = pd.merge(df,df2,left_on = 'col2', right_on = 'key',how = 'right')
df6 = pd.merge(df,df2,left_on = 'col2', right_on = 'key',how = 'inner')
df7 = pd.merge(df,df2,left_on = 'col2', right_on = 'key',how = 'outer')

# Right and left joins are basically the same, just different way around
# Compare df8 to df5
df8 = pd.merge(df2,df,left_on = 'key', right_on = 'col2',how = 'left')

display_side_by_side(df3,df4,df5,df6,df7,df8)

,col1,col2,col3,col4,key,vals
0,0,1,2,3,0,4
1,4,5,6,7,1,6
2,8,9,10,11,2,8
,col1,col2,col3,col4,key,vals
0,0,1,2,3,1.0,6.0
1,4,5,6,7,NaN,NaN
2,8,9,10,11,NaN,NaN
,col1,col2,col3,col4,key,vals
0,0.0,1.0,2.0,3.0,1,6
1,NaN,NaN,NaN,NaN,0,4
2,NaN,NaN,NaN,NaN,2,8
,col1,col2,col3,col4,key,vals
0,0,1,2,3,1,6
,col1,col2,col3,col4,key,vals
0,0.0,1.0,2.0,3.0,1.0,6.0
1,4.0,5.0,6.0,7.0,NaN,NaN
2,8.0,9.0,10.0,11.0,NaN,NaN
3,NaN,NaN,NaN,NaN,0.0,4.0
4,NaN,NaN,NaN,NaN,2.0,8.0
,key,vals,col1,col2,col3,col4
0,0,4,NaN,NaN,NaN,NaN
1,1,6,0.0,1.0,2.0,3.0
2,2,8,NaN,NaN,NaN,NaN

## Aggregating infromation in DataFrame

### Simple means, medians etc.

In [38]:
# Simple example
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
df.iloc[:2,1] = np.nan
display(df)

# Mean by column, change axis=0 to get rows
display(df.mean(axis=1, skipna=False))
display(df.mean(axis=1, skipna=True))

              ff        ee        tt       uuu
first   0.577229       NaN  0.934214  0.613966
second  0.535633       NaN  0.730122  0.311945
third   0.398221  0.209844  0.186193  0.944372
fourth  0.739551  0.490459  0.227415  0.254356

first          NaN
second         NaN
third     0.434658
fourth    0.427945
dtype: float64

first     0.708470
second    0.525900
third     0.434658
fourth    0.427945
dtype: float64

In [2]:
# Easy way to calculate aggregations using lambdas and apply
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
cols_to_apply = [
                'ff'
                ,'tt'
                ,'uuu']
df2 = pd.DataFrame(df.apply(lambda x: np.max(x[cols_to_apply]) , axis = 1), columns = ['Max of column subset'])
df3 = pd.DataFrame(df.apply(lambda x: np.mean(x[cols_to_apply]) , axis = 1), columns = ['Mean of column subset'])

display_side_by_side(df,df2,df3)

### 'Group by' in various forms

In [2]:
data = {'ID': [1, 1, 2],'Names': ['Kate', 'John', 'Max'],'Age': [50, 25, 40], 'Values': [3, 4, 8]}
df = pd.DataFrame(data=data, index = ['first','second','first'])
df.index.name = 'Index'

result1 = df.groupby(['ID'])['Values'].sum()
result1 = pd.DataFrame(result1)

result2 = df.groupby([df.index])['Age'].mean()
result2 = pd.DataFrame(result2)

result3 = df.groupby([df.index])['Age'].count()
result3 = pd.DataFrame(result3)

display_side_by_side(df, result1,result2,result3)

In [8]:
# Calculate count of occurences with certain combo in n columns
data = {'ID': [1, 1, 1, 2, 2],'Type': ['moo', 'boo', 'boo', 'boo', 'moo'], 'Values': [3, 4, 6, 7, 4]}
df = pd.DataFrame(data=data)

# They magic touch is reset_index: count calculation is done on this new column!
df = df[['ID', 'Type']].reset_index().groupby(['ID','Type'], as_index = False).count()
df.columns = ['ID', 'Type', 'count']
df

   ID Type  count
0   1  boo      2
1   1  moo      1
2   2  boo      1
3   2  moo      1

In [12]:
# Select sum of first greatest N values within group
data = {'ID': [1, 2, 1, 2, 1], 'Values': [3, 9, 8, 7, 3]}
df = pd.DataFrame(data=data)

df2 = df.copy()
df2.sort_values(['ID','Values'],ascending=[True, False],inplace=True)
df2 = df2.groupby('ID').head(2)
df2 = df2.groupby(['ID'])['Values'].sum().sort_values(ascending = False)

df2 = pd.DataFrame(df2)
display_side_by_side(df,df2)

In [25]:
# Combinations of group by and apply: caluclations between grouped columns
# Example: Total price of each product bought
df = pd.DataFrame({'Product': [1, 2, 1, 2],'Quantity': [1, 3, 2, 2], 'Price': [10, 20, 5, 2]})
df2 = pd.DataFrame(df.groupby(['Product']).apply(lambda df,a,b: sum(df[a] * df[b]), 'Quantity', 'Price'))
display_side_by_side(df,df2)

### Agg method

In [52]:
# Agg is similar to apply, but agg gives the flexibility of
# applying multiple functions at once. Agg() is handy at handling
# DataFrameGroupBy objects compared to apply()
df = pd.DataFrame({"name":["Foo", "Baar", "Foo", "Baar"]
                   ,"score_1":[5,10,15,10]
                   ,"score_2" :[10,15,10,25]
                   ,"score_3" : [10,20,30,40]})

# Mean and sum of "score_2" grouped by "name" and "score_1" columns using apply
print(df.groupby(["name", "score_1"])["score_2"].apply(lambda x : x.mean()))
print(df.groupby(["name", "score_1"])["score_2"].apply(lambda x : x.sum()))

# Same with agg(), and even more aggregations applied to multiple columns, all at the same go!
df2 = df.groupby(["name", "score_1"]).agg({"score_2" :[np.mean, np.sum, np.max, np.min], "score_3": [np.mean]}).copy()

# You can also pass in a lambda function to agg
df3 = df.groupby(["name", "score_1"]).agg({ "score_3": lambda x: x.mean()}).copy()

display_side_by_side(df2,df3)

name  score_1
Baar  10         20.0
Foo   5          10.0
      15         10.0
Name: score_2, dtype: float64
name  score_1
Baar  10         40
Foo   5          10
      15         10
Name: score_2, dtype: int64

### Pivot table

In [11]:
df = pd.DataFrame({"name":["Foo", "Baar", "Foo", "Baar"]
                   ,"name2":['mm','mm','mm','ee']
                   ,"score_1" :[10,15,10,25]
                   ,"score_2" : [10,20,30,40]})

# Basics
df2 = df.pivot_table(values='score_1', index='name', columns='name2', aggfunc=[np.mean,np.max]).copy()
df3 = df.pivot_table(values='score_1', index='name', columns='name2', aggfunc=[np.mean,np.min], margins=True).copy()

# Shares out of row sum
df4 = df.pivot_table(values='score_1', index='name', columns='name2', aggfunc=[np.sum], margins=True).copy()
df4.columns = df4.columns.get_level_values(1)
df4.drop(['All'], axis = 0 , inplace = True)
df4.fillna(0, inplace = True)
df5 = df4.copy()
for _, row in df5.iterrows():
    row[0:-1] = row[0:-1] / row[-1]

display_side_by_side(df,df2,df3)
display_side_by_side(df4, df5)

name2,ee,mm,All
name,,,
Baar,25.0,15.0,40.0
Foo,0.0,20.0,20.0
name2,ee,mm,All
name,,,
Baar,0.625,0.375,40.0
Foo,0.000,1.000,20.0

<h1>Data cleaning</h1>

## Replace all non-numerical values with NaN

In [158]:
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
df.iloc[2,1] = 'dd'
df.iloc[1,2] = '-----'
df.iloc[2,2] = '#SomeErrorVal'
df2 = df.copy()

cols = ['ff', 'ee','tt','uuu']
for col in cols:
    df2[col][df2.apply(lambda x: np.isreal(x[col]) == True , axis = 1) == False] = np.nan

display_side_by_side(df,df2)

C:\Users\ville_000\Anaconda3\lib\site-packages\ipykernel\__main__.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,ff,ee,tt,uuu
first,0.075799,0.0480505,0.461073,0.014180
second,0.596698,0.951108,-----,0.755430
third,0.278439,dd,#SomeErrorVal,0.546192
fourth,0.163601,0.885995,0.735375,0.605176
,ff,ee,tt,uuu
first,0.075799,0.0480505,0.461073,0.014180
second,0.596698,0.951108,NaN,0.755430
third,0.278439,NaN,NaN,0.546192
fourth,0.163601,0.885995,0.735375,0.605176

## Clean NaN values

In [13]:
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
df.iloc[2,1] = np.nan
df.iloc[1,3] = np.nan
df.iloc[0,0] = np.nan
df2 = df.copy()

# Calculate number of NaNs in column
print('Column ee has {} NaNs'.format(pd.isnull(df['ee']).sum()))

# Fill NaN by mean of the column
df2['ee'].fillna(df['ee'].mean(), inplace = True)

# Fill using value from previuous row
df2['uuu'].fillna(method='bfill', inplace = True)

# Fill using value from next row
df2['ff'].fillna(method='bfill', inplace = True)

display_side_by_side(df,df2)

Column ee has 1 NaNs

,ff,ee,tt,uuu
first,NaN,0.653705,0.457660,0.946132
second,0.000315,0.274878,0.632130,NaN
third,0.351377,NaN,0.205840,0.801181
fourth,0.728026,0.268206,0.443132,0.311159
,ff,ee,tt,uuu
first,0.000315,0.653705,0.457660,0.946132
second,0.000315,0.274878,0.632130,0.801181
third,0.351377,0.398930,0.205840,0.801181
fourth,0.728026,0.268206,0.443132,0.311159

# Working with time and dates

## Time and date data types

Pandas use 4 types of time functionalities
<ol>
  <li>Timestamp: a point in time</li>
  <li>Period: period spanning over time range</li>
  <li>DatetimeIndex</li>
  <li>PeriodIndex</li>
</ol>

<b> It is recommended to use yyyy-mm-dd convetion for dates!</b> This avoids the danger misinterpretation of months vs. days.

In [34]:
# Both of these create a TimeStamp, but only latter accepts frontward European convention!
display(pd.Timestamp('2008-12-10'))
display(pd.to_datetime('10-12-2008', dayfirst = True, format = '%d-%m-%Y')) # only to_datime has dayfirst option!

Timestamp('2008-12-10 00:00:00')

Timestamp('2008-12-10 00:00:00')

In [98]:
# Examples of periods
display(pd.Period('2013'))
display(pd.Period('2017Q1'))
display(pd.Period('05/2017'))
display(pd.Period('2017-12-10'))

Period('2013', 'A-DEC')

Period('2017Q1', 'Q-DEC')

Period('2017-05', 'M')

Period('2017-12-10', 'D')

In [132]:
# TimeStamp and Period indices in DataFrames
df1 = pd.DataFrame(np.arange(3), [pd.Timestamp('2008-12-10'),pd.Timestamp('2008-12-11'),pd.Timestamp('2008-12-12')])
df2 = pd.DataFrame(np.arange(3), [pd.Period('2008-12-10'),pd.Period('2008-12-11'),pd.Period('2008-12-12')])
df3 = pd.DataFrame(np.arange(3), [pd.Period('2008Q2'),pd.Period('2008Q3'),pd.Period('2008Q4')])
df4 = pd.DataFrame(np.arange(4), pd.date_range('2016-10-01', periods=4, freq='1D'))
df5 = pd.DataFrame(np.arange(4), pd.date_range('2016-10-01', periods=4, freq='3W-SUN')) #SUN specifies we want only sundays
display_side_by_side(df1,df2,df3,df4,df5)

,0
2008-12-10,0
2008-12-11,1
2008-12-12,2
,0
2008-12-10,0
2008-12-11,1
2008-12-12,2
,0
2008Q2,0
2008Q3,1
2008Q4,2
,0
2016-10-01,0
2016-10-02,1
2016-10-03,2
2016-10-04,3
,0
2016-10-02,0
2016-10-23,1
2016-11-13,2
2016-12-04,3

In [32]:
# Convert column into a PeriodIndex
df = pd.DataFrame({'Quarter': ['2008-01-01','2008-04-01','2008-07-01'], 'Values': [5,3,8]})
df2 = pd.DataFrame()
df2['Values'] = df['Values']
df2.index = pd.PeriodIndex(df['Quarter'], freq = '1Q')
df2.index.name = None

df3 = pd.DataFrame({'Year': ['2008','2009','2010'], 'Values': [5,3,8]})
df4 = pd.DataFrame()
df4['Values'] = df3['Values']
df4.index = pd.PeriodIndex(df3['Year'], freq = '1A')
df4.index.name = None

display_side_by_side(df,df2,df3,df4)

In [110]:
#TimeDelta is the difference between two TimeStamps
display(pd.Timestamp('2008-12-10') - pd.Timestamp('2009-04-10'))

Timedelta('-121 days +00:00:00')

## Time series tricks

### Basic operations

In [144]:
# Start indexing from Thursday 2009-10-01
df = pd.DataFrame({'Values': np.random.randn(8).cumsum()}
                  ,index = pd.date_range('2009-10-01', periods=8, freq='1W-THU'))

# Nth differences
df2 = df.diff(2).copy()

# Resample to monthly by mean (or sum, min, max)
df3 = df.resample('M').mean().copy()

# Slice DataFrame to only include observations between some range
df4 = df['2009-10-09':'2009-11-07'].copy()

# Change frequency
df5 = df.asfreq('2W-THU').copy()

display_side_by_side(df,df2, df3,df4,df5)

,Values
2009-10-01,1.417639
2009-10-08,1.880599
2009-10-15,1.687781
2009-10-22,0.470321
2009-10-29,-0.195761
2009-11-05,2.369993
2009-11-12,2.618214
2009-11-19,2.572185
,Values
2009-10-01,NaN
2009-10-08,NaN
2009-10-15,0.270141
2009-10-22,-1.410278
2009-10-29,-1.883542
2009-11-05,1.899672
2009-11-12,2.813975
2009-11-19,0.202191
,Values
2009-10-31,1.052116
2009-11-30,2.520131
,Values
2009-10-15,1.687781
2009-10-22,0.470321
2009-10-29,-0.195761
2009-11-05,2.369993
,Values
2009-10-01,1.417639
2009-10-15,1.687781
2009-10-29,-0.195761
2009-11-12,2.618214

<h3>Get mean value per day over multiple years</h3>

In [78]:
startdate = datetime.datetime(2004, 1, 1)
enddate = datetime.datetime(2008, 1, 1)
days = (enddate + datetime.timedelta(days=1) - startdate).days
data = np.random.random(days)
dates = [startdate + datetime.timedelta(days=x) for x in range(0, days)]

ts = pd.DataFrame(data, dates, columns = ['values'])
ts.index.names = ['Day']

# Average at each day over multiple years
day_averages = ts.groupby([ts.index.month, ts.index.day]).mean()
day_averages.index.names = ['Month', 'Day']
day_averages.columns = ['avg_values']

display_side_by_side(ts.head(10), pd.DataFrame(day_averages).head(10))